"""Задани 4"""

print(14 - 7)  # 1. Вычесть из 14 число 7.
print(18 * 9)  # 2. Умножить 18 на 9.
print(14 + 1)  # 3. Сложить 14 и 1.
print(24 % 8)  # 4. Вычислить остаток от деления 24 на 8.
print(21 / 4)  # 5. Разделить 21 на 4.
print(15 * 18)  # 6. Умножить 15 на 18.
print(1 + 17)  # 7. Сложить 1 и 17.
print(28 % 5)  # 8. Вычислить остаток от деления 28 на 5.
print(2 - 8)  # 9. Вычесть из 2 число 8.
print(22 / 9)  # 10. Разделить 22 на 9.
print(9 - 5)  # 11. Вычесть из 9 число 5.
print(21 % 3)  # 12. Вычислить остаток от деления 21 на 3.
print(14 + 19)  # 13. Сложить 14 и 19.
print(23 / 6)  # 14. Разделить 23 на 6.
print(5 * 14)  # 15. Умножить 5 на 14.
print(12 - 12)  # 16. Вычесть из 12 число 12.
print(10 * 18)  # 17. Умножить 10 на 18.
print(25 / 4)  # 18. Разделить 25 на 4.
print(24 % 10)  # 19. Вычислить остаток от деления 24 на 10.
print(19 + 16)  # 20. Сложить 19 и 16.
print(22 % 8)  # 21. Вычислить остаток от деления 22 на 8.
print(11 * 16)  # 22. Умножить 11 на 16.
print(8 + 10)  # 23. Сложить 8 и 10.
print(23 / 9)  # 24. Разделить 23 на 9.
print(11 - 14)  # 25. Вычесть из 11 число 14.
print(7 * 13)  # 26. Умножить 7 на 13.
print(19 + 16)  # 27. Сложить 19 и 16.
print(22 / 3)  # 28. Разделить 22 на 3.
print(24 % 10)  # 29. Вычислить остаток от деления 24 на 10.
print(8 - 10)  # 30. Вычесть из 8 число 10.
print(8 - 20)  # 31. Вычесть из 8 число 20.
print(22 / 10)  # 32. Разделить 22 на 10.
print(18 + 13)  # 33. Сложить 18 и 13.
print(26 % 4)  # 34. Вычислить остаток от деления 26 на 4.
print(20 * 4)  # 35. Умножить 20 на 4.
print(21 % 4)  # 36. Вычислить остаток от деления 21 на 4.
print(3 * 18)  # 37. Умножить 3 на 18.
print(3 + 2)  # 38. Сложить 3 и 2.
print(16 - 8)  # 39. Вычесть из 16 число 8.
print(27 / 6)  # 40. Разделить 27 на 6.
print(26 % 5)  # 41. Вычислить остаток от деления 26 на 5.
print(10 + 11)  # 42. Сложить 10 и 11.
print(19 - 16)  # 43. Вычесть из 19 число 16.
print(1 * 11)  # 44. Умножить 1 на 11.
print(21 / 10)  # 45. Разделить 21 на 10.
