"""Задание 7"""

d = {'a': 1, 'b': 3, 'c': 12}

# 1. Добавить любую новую пару ключ-значение в словарь d.
# Посмотреть содержимое переменной d

d = {'a': 1, 'b': 3, 'c': 12}
d['x'] = 18
print(d)

# 2. Удалить значение ключу 'b'.
# Посмотреть содержимое переменной d.

d = {'a': 1, 'b': 3, 'c': 12}
del d['b']
print(d)

# 3. Изменить значение по ключу 'b' на 20
# Посмотреть содержимое переменной d.

d = {'a': 1, 'b': 3, 'c': 12}
d['b'] = 20
print(d)

# 4. Получить значение по ключу 'b'

d = {'a': 1, 'b': 3, 'c': 12}
print(d['b'])

# 5. Добавить любую новую пару ключ-значение в словарь d.
# Посмотреть содержимое переменной d

d = {'a': 1, 'b': 3, 'c': 12}
d['f'] = 33
print(d)

# 6. Удалить значение ключу 'a'.
# Посмотреть содержимое переменной d.

d = {'a': 1, 'b': 3, 'c': 12}
del d['a']
print(d)

# 7. Изменить значение по ключу 'b' на 11
# Посмотреть содержимое переменной d.

d = {'a': 1, 'b': 3, 'c': 12}
d['b'] = 11
print(d)

# 8. Получить значение по ключу 'c'

d = {'a': 1, 'b': 3, 'c': 12}
print(d['c'])

# 9. Добавить любую новую пару ключ-значение в словарь d.
# Посмотреть содержимое переменной d

d = {'a': 1, 'b': 3, 'c': 12}
d['x'] = 75
print(d)

# 10. Удалить значение ключу 'b'.
# Посмотреть содержимое переменной d.

d = {'a': 1, 'b': 3, 'c': 12}
del d['b']
print(d)

# 11. Изменить значение по ключу 'b' на 14
# Посмотреть содержимое переменной d.

d = {'a': 1, 'b': 3, 'c': 12}
d['b'] = 14
print(d)

# 12. Получить значение по ключу 'c'

d = {'a': 1, 'b': 3, 'c': 12}
print(d['c'])

# 13. Добавить любую новую пару ключ-значение в словарь d.
# Посмотреть содержимое переменной d

d = {'a': 1, 'b': 3, 'c': 12}
d['y'] = 46
print(d)
