"""Задание 12"""
# Написать функцию которая спрашивает имя пользователя а потом приветствует его.

name = input('Как тебя зовут? ')
print('Приветствую тебя ' + name + '!')