"""Задание 30 sql (задачки на сайте)""" #DONE

# 1. Зарегистрироваться на http://www.sql-ex.ru
#    Записать куда-нибудь логин\пароль.

#done

# 2. Слева вверху раскрыть пункт меню "Упражнения по SQL" -> "SELECT (обучающий этап)".
#    или http://www.sql-ex.ru/learn_exercises.php
#    Сделать упражнения с 1 по 5 включительно.

#done

# 3. Слева вверху раскрыть пункт меню "Упражнения по SQL" -> "DML".
#    или http://www.sql-ex.ru/dmlexercises.php
#    Сделать упражнения с 1 по 5 включительно.

#done

